# Generated with `brew bundle dump`
# https://github.com/Homebrew/homebrew-bundle

tap "dart-lang/dart"
tap "hougesen/tap"
tap "krishkrosh/apps"
tap "quarkdown-labs/quarkdown"
brew "act"
brew "webp"
brew "btop"
brew "buf"
brew "checkmake"
brew "chezmoi"
brew "cmake"
brew "codespell"
brew "lima"
brew "colima"
brew "coreutils"
brew "diff-so-fancy"
brew "direnv"
brew "docker"
brew "docker-compose"
brew "docutils"
brew "dpkg"
brew "exiftool"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "git-lfs"
brew "git-who"
brew "glab"
brew "gnu-sed"
brew "gnupg"
brew "go"
brew "go-task"
brew "go@1.21"
brew "go@1.23"
brew "goenv"
brew "golangci-lint"
brew "golangci-lint@1.64", link: true
brew "gpgme"
brew "graphicsmagick"
brew "groff"
brew "heimdal"
brew "htop"
brew "hugo"
brew "hunspell"
brew "lazydocker"
brew "libiconv"
brew "libssh2"
brew "ls-lint"
brew "lychee"
brew "markdownlint-cli2"
brew "ninja"
brew "meson"
brew "mise"
brew "mysql"
brew "mysql-client"
brew "mysql@8.4"
brew "pipx"
brew "pnpm"
brew "protobuf"
brew "pyenv"
brew "qemu"
brew "revive"
brew "rsync"
brew "runit"
brew "taplo"
brew "tree"
brew "typos-cli"
brew "vale"
brew "wget"
brew "yamllint"
brew "yq"
brew "dart-lang/dart/dart"
brew "hougesen/tap/mdsf"
cask "flameshot"
cask "google-chrome"
cask "keeweb"
cask "maccy"
cask "rectangle"
cask "slack"
cask "trackweight"
cask "visual-studio-code"
cask "wireshark-app"
vscode "42crunch.vscode-openapi"
vscode "aaron-bond.better-comments"
vscode "astro-build.astro-vscode"
vscode "chrischinchilla.vale-vscode"
vscode "connor4312.esbuild-problem-matchers"
vscode "cweijan.dbclient-jdbc"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "dcortes92.freemarker"
vscode "deque-systems.vscode-axe-linter"
vscode "docker.docker"
vscode "donjayamanne.githistory"
vscode "dotenv.dotenv-vscode"
vscode "echoapi.echoapi-for-vscode"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "gitlab.gitlab-workflow"
vscode "golang.go"
vscode "google.geminicodeassist"
vscode "hjb2012.vscode-es6-string-html"
vscode "huizhou.githd"
vscode "humao.rest-client"
vscode "joselitofilho.ginkgotestexplorer"
vscode "joyceerhl.github-graphql-nb"
vscode "joyceerhl.vscode-graphql-notebook"
vscode "kumar-harsh.graphql-for-vscode"
vscode "mathematic.vscode-latex"
vscode "mcright.auto-save"
vscode "mermade.openapi-lint"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.live-server"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-repositories"
vscode "ms-vsliveshare.vsliveshare"
vscode "peterj.proto"
vscode "plex.vscode-protolint"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "ruschaaf.extended-embedded-languages"
vscode "ryanluker.vscode-coverage-gutters"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "shopify.ruby-lsp"
vscode "steditor.line-endings"
vscode "streetsidesoftware.code-spell-checker"
vscode "streetsidesoftware.code-spell-checker-cspell-bundled-dictionaries"
vscode "streetsidesoftware.code-spell-checker-ukrainian"
vscode "tamasfe.even-better-toml"
vscode "tekumara.typos-vscode"
vscode "tobermory.es6-string-html"
vscode "tomoki1207.pdf"
vscode "tooltitudeteam.tooltitude-pb"
vscode "unifiedjs.vscode-mdx"
vscode "vs-publisher-1448185.keyoti-changeallendoflinesequence"
vscode "vscodevim.vim"
vscode "waderyan.gitblame"
vscode "yy0931.vscode-sqlite3-editor"
vscode "yzhang.markdown-all-in-one"
vscode "ziyasal.vscode-open-in-github"
