# Generated with `brew bundle dump`
# https://github.com/Homebrew/homebrew-bundle

tap "azure/kubelogin"
tap "go-task/tap"
tap "homebrew/bundle"
tap "homebrew/cask-versions"
tap "snyk/tap"
tap "sonatype-nexus-community/nancy-tap"
brew "jpeg-xl"
brew "python@3.11"
brew "azure-cli"
brew "bash"
brew "bmake"
brew "python@3.12"
brew "coreutils"
brew "curl", link: true
brew "dart-sdk"
brew "diff-so-fancy"
brew "docker"
brew "docker-compose"
brew "dotnet"
brew "gh"
brew "git"
brew "git-codereview"
brew "gnu-sed"
brew "gnutls"
brew "gnupg"
brew "go"
brew "go@1.21"
brew "golang-migrate"
brew "golangci-lint"
brew "gpgme"
brew "harfbuzz"
brew "pango"
brew "graphviz"
brew "helm"
brew "highlight"
brew "htmlq"
brew "htop"
brew "hugo"
brew "hyperfine"
brew "jq"
brew "kubectx"
brew "libpq"
brew "qemu"
brew "lima"
brew "linkerd"
brew "make"
brew "minikube"
brew "mockery"
brew "neovim"
brew "nvm"
brew "openapi-generator"
brew "pcre"
brew "podman"
brew "pre-commit"
brew "protobuf"
brew "pyenv"
brew "python@3.10"
brew "python@3.9"
brew "rover"
brew "semgrep"
brew "shellcheck"
brew "socket_vmnet"
brew "sql-lint"
brew "sqlc"
brew "telnet"
brew "tilt"
brew "tree"
brew "typos-cli"
brew "virtualenv", link: false
brew "watch"
brew "wget"
brew "youtube-dl"
brew "yq"
brew "zsh-completions"
brew "azure/kubelogin/kubelogin"
brew "go-task/tap/go-task"
brew "snyk/tap/snyk"
brew "sonatype-nexus-community/nancy-tap/nancy"
cask "firefox-developer-edition"
cask "keepassxc"
cask "warp"
cask "wireshark"
vscode "42crunch.vscode-openapi"
vscode "arjun.swagger-viewer"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "dcortes92.freemarker"
vscode "donjayamanne.githistory"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "gitlab.gitlab-workflow"
vscode "golang.go"
vscode "googlecloudtools.cloudcode"
vscode "huizhou.githd"
vscode "humao.rest-client"
vscode "idleberg.haskell-nsis"
vscode "idleberg.nsis"
vscode "mcright.auto-save"
vscode "mquandalle.graphql"
vscode "ms-azure-devops.azure-pipelines"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.azure-account"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.live-server"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-repositories"
vscode "netcorext.uuid-generator"
vscode "orta.vscode-jest"
vscode "peterj.proto"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "ryanluker.vscode-coverage-gutters"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "sonarsource.sonarlint-vscode"
vscode "steditor.line-endings"
vscode "streetsidesoftware.code-spell-checker"
vscode "tamasfe.even-better-toml"
vscode "tilt-dev.tiltfile"
vscode "twxs.cmake"
vscode "unifiedjs.vscode-mdx"
vscode "vs-publisher-1448185.keyoti-changeallendoflinesequence"
vscode "vscodevim.vim"
vscode "yzhang.markdown-all-in-one"
vscode "ziyasal.vscode-open-in-github"
